import { makeStyles } from "@material-ui/core";
import React from "react";
import ModalHeader from "./ModalHeader";
import ModalWrapperCustom from "./ModalWrapperCustom";

const useStyles = makeStyles(theme => ({
  root: {
    maxHeight: "500px",
    overflowY: "auto",
    padding: "10px",
    "@media only screen and (max-width: 768px)": {
      maxHeight: "85%",
    },
    "& h2": {
      ...theme.font.s16w700,
      marginBottom: "25px",
    },
    "& h3": {
      ...theme.font.s14w700,
      marginBottom: "15px",
    },
    "& h4": {
      ...theme.font.s14w700,
      marginBottom: "15px",
    },
    "& p": {
      ...theme.font.s14w700,
      marginBottom: "25px",
    },
    "& ul": {
      listStyleType: "disc",
      padding: "10px",
    },
    "& li": {
      ...theme.font.s12w700,
      marginBottom: "18px",
    },
  },
  formFooter: {
    display: "flex",
    justifyContent: "flex-end",
    marginTop: 24,
  },
}));

const ModalRules = () => {
  const classes = useStyles();

  return (
    <ModalWrapperCustom>
      <ModalHeader title="قوانین و مقررات" />
      <div className={classes.root}>
        <p>
          فروشگاه اینترنتی شرکت راهساز ماشین عرشیا ایرانیان به منظور ارائه تخصصی
          لوازم یدکی لودرهای چینی، برای اولین بار در ایران راه اندازی شد. تیم
          فنی ما بیش از ۸ ماه وقت صرف طراحی سایت و بیش از هزار ساعت کار صرف
          چیدمان آن نمود.همکاران ما همواره در حال بروز رسانی سایت و افزودن محتوا
          جدید و کاربردی به آن هستند.
        </p>
        <p>
          هرگونه کپی برداری از سایت راهساز ماشین غیر قانونی بوده و تمامی حقوق
          معنوی و مادی سایت برابر قانون برای راهساز ماشین محفوظ میباشد.
        </p>
        <ul>
          <li>
            قیمت گذاری در راهساز ماشین مبنی بر رعایت حقوق مشتریان و احترام به
            حقوق مصرف کننده است.
          </li>
          <li>
            مدت زمان ارسال مرسولات بسته به وزن کالا و بر اساس نوع ارسال متفاوت
            بوده و از تاریخ پرداخت مبلغ سفارش محاسبه میگردد، ملاک محاسبه روزهای
            کاری هفته می باشد.
          </li>
          <li>
            ثبت تمامی سفارشات بصورت ۲۴ساعت انجام میگیرد، و ارسال آنها در هر روز
            کاری طی دو مرحله صبح و عصر انجام میگیرد. سفارشاتی که در ایام تعطیل
            دریافت گردند در اولین روز کاری بعد از تعطیلات ارسال خواهند شد.
            روزهای کاری از شنبه الی چهارشنبه از ساعت ۸:۳۰ دقیقه الی ۱۸ و پنجشنبه
            از ساعت ۸:۳۰ الی ۱۴:۳۰ میباشد. جمعه و ایام تعطیل رسمی جمهوری اسلامی
            ایران روز کاری محسوب نمیگردد
          </li>
          <li>
            کاربران محترم می بایست در هنگام انتخاب کالا مورد نظر، دقت لازم را
            داشته و ویژگی های کالا را اعم از ابعاد، جنس،رنگ و غیره را بررسی
            کنند، و سبد خرید خود را به صورت صحیح تکمیل کنند. بدیهی است مسئولیت
            هرگونه نقص در تکمیل فرآیند انتخاب کالا و تکمیل سبد خرید به عهده
            خریدار میباشد.
          </li>
          <li>
            مسئولیت تاخیر ارسال کالا در صورت بروز حوادث غیر مترقبه شامل
            سیل،زلزله،آتش سوزی و سایر مواردی که از اختیار انسان خارج است، به
            عهده شرکت راهساز ماشین نبوده و تاخیر در ارسال محسوب نمیگردد
          </li>
          <li>
            هزینه ارسال کالا توسط حمل کننده ها بعهده خریدار و بر اساس توافق و یا
            تعرفه باربری میباشد.هرگونه قصور و سهل انگاری حمل کننده ها در ارسال
            سریع و صحیح و سالم کالا خارج از عهده و مسئولیت راهساز ماشین میباشد.
          </li>
          <li>
            در صورت تمایل مشتری، فاکتور رسمی به آدرس پستی خریدار ارسال میگردد
          </li>
          <li>
            شرایط فعال سازی گارانتی محصول منوط به نصب قطعه توسط تیم فنی راهساز
            ماشین است، همچنین موارد دیگر از جمله بررسی های دوره ای تیم فنی
            راهساز ماشین و تایید نهایی نقص قطعه توسط آنان در تایید گارانتی لازم
            میباشد.
          </li>
          <li>
            گارانتی و خدمات پس از فروش برای هر کالا به صورت جداگانه اعلام
            میشود،خریدار با علم و اطلاع کامل از موارد یاد شده نسبت به درخواست
            گارانتی اقدام میکند و شرایط گارانتی به صورت مکتوب به مشتری اعلام می
            گردد. در صورت عدم پذیرش هر یک از شرایط مذکور از طرف خریدار، راهساز
            ماشین هیچگونه مسئولیتی در قبال گارانتی کالا نداشته و خریدار هرگونه
            حقی در خصوص گارانتی و خدمات پس از فروش را از خود سلب مینماید
          </li>
          <li>
            راهساز ماشین همواره در ارسال و تحویل کلیه سفارش‌‏های ثبت شده، نهایت
            دقت و تلاش خود را دارد. با وجود این، در صورتی که موجودی محصولی در
            انبار ما به پایان برسد، حتی پس از اقدام مشتری به سفارش‌‏گذاری، حق
            کنسل کردن آن سفارش و استرداد وجه سفارش به مشتری برای راهساز ماشین
            محفوظ است
          </li>
        </ul>
        <h2>قوانین مربوط به انصراف و عودت کالا</h2>
        <ul>
          <li>
            چنانچه کالا پس از تایید سفارش مشتری به ادرس وی ارسال شده و با فاکتور
            خرید مغایرت داشته باشد، در صورتی که کالا استفاده نشده و بسته بندی
            باز نگردیده باشد، حق انصراف برای مشتری محفوظ و مشتری می تواند حداکثر
            تا ۲ روز کاری پس از دریافت کالا نسبت به عودت کالا اقدام کند. لازم به
            ذکر است، پرداخت کلیه هزینه حمل و نقل تا درب انبار شرکت،تعویض یا رفع
            نقص، درصورت تایید مغایرت یا نقص کالا به عهده راهسازماشین خواهد بود.
            در صورت باز شدن بسته بندی و یا مورد استفاده قرار گرفتن کالا، انصراف
            و عودت کالا غیر قابل قبول میباشد
          </li>
          <li>
            لافاصله موضوع را به اطلاع شرکت راهساز ماشین برساند و نسبت به عودت
            کالا اقدام نماید. پس از دریافت کالا توسط شرکت راهساز ماشین و انجام
            بررسی های لازم، در صورت صحت موضوع و تایید آن ، راهساز ماشین موظف به
            ارائه قطعه جایگزین و یا عودت وجه کالا می باشد. بدیهی است چنانچه بروز
            مشکل به علت سهل انگاری حمل کننده ها در ارسال کالا و یا استفاده نا
            صحیح مصرف کننده باشد شرکت راهساز ماشین هیچگونه مسئولیتی در قبال آن
            ندارد
          </li>
        </ul>
        <h2>شرایط گارانتی</h2>
        <p>
          هدف شرکت راهساز ماشین ارائه محصولات با کیفیت، مطابق با نیاز مشتریان
          است. بدیهی است مراحل نصب و نگهداری طی دوره گارانتی از موارد بسیار مهمی
          است؛که میبایست به آن توجه ویژه ای داشت و خریدار ملزم و متعهد به رعایت
          مفاد و قوانین مربوط به دوره گارانتی میباشد. کلیه قطعات ارائه شده (به
          استثناء قطعات مصرفی) توسط راهساز ماشین طبق شرایط و مقررات زیر دارای
          گارانتی میباشد.
        </p>
        <h2>شرایط عمومی گارانتی و خدمات پس از فروش</h2>
        <ul>
          <li>
            درصورت بروز خرابی قطعه ارائه شده، شرکت موظف به جایگزینی قطعه رایگان
            براساس قوانین و مقررات دوره گارانتی میباشد
          </li>
          <li>
            فعال سازی دوره گارانتی و خدمات پس از فروش تنها با عقد قرارداد رسمی
            بین خریدار و شرکت راهساز ماشین میسر است
          </li>
          <li>
            تعویض و نصب قطعات الزاما توسط تیم فنی شرکت راهساز ماشین صورت میگیرد.
          </li>
          <li>
            قطعات بسته موقعیت محل نصب و نوع قطعه دوره گارانتی متفاوتی دارند
          </li>
          <li>
            همزمان با عقد قرارداد، گارانتی و خدمات پس از فروش،کلیه هزینه های
            تعویض و نصب، خدمات سرویس های ادواری،ایاب و ذهاب نقدا تسویه میگردد
          </li>
          <li>
            مواد مصرفی نظیر روغن موتور و فیلترجات و سایر مواردی که به صورت
            مستقیم یا غیر مستقیم با قطعات شامل گارانتی درگیر و مرتبط است، توسط
            راهساز ماشین تامین و خریدار نقدا وجه آن را تسویه میکند
          </li>
        </ul>
        <p>
          شرکت راهسازماشین جهت ارائه خدمات ،در حداقل زمان ممکن،تا اطلاع ثانوی تا
          شعاع ۲۰۰ کیلومتری دفتر مرکزی شرکت آماده ارائه خدمات گارانتی میباشد.
          بدیهی است شرایط گارانتی شرکت بیشتر مناسب تعمیرات اساسی ماشین آلات بوده
          و در صورت پذیرش مفاد و مقررات مربوط به دوره گارانتی، توسط خریدار کلیه
          قطعات یدکی شامل گارانتی خواهد بود
        </p>
        <h3>مواردی که شامل گارانتی نمی باشند:</h3>
        <h4>الف) استفاده نادرست:</h4>
        <ul>
          <li>آسیب های وارده به دلیل استفاده بیش از ظرفیت مجاز ماشین آلات.</li>
          <li>
            آسیب هایی که بر اثر رانندگی بدون مهارت و کاربری غیر اصولی به وجود
            آید.
          </li>
          <li> آسیب های وارده بر اثر نگهداری نادرست و یا نامناسب ماشین آلات</li>
          <li>
            آسیب هایی که بر اثر عدم استفاده از سوخت استاندارد و یا مسدود بودن
            خطوط سوخت رسانی بوجود آید
          </li>
          <li>
            آسیب هایی که بر اثر استفاده از قطعات غیر اصلی به ویژه فیلترها بوجود
            آید.
          </li>
          <li>
            آسیب هایی که بر اثر استفاده از روغن،ضدیخ و دیگر مواد مصرفی
            غیراستاندارد و تایید نشده توسط شرکت راهساز ماشین بوجود آید
          </li>
          <li>
            استفاده غیرمجاز،راهپیمایی طولانی،تعمیرات توسط افراد خارج از سیستم
            تیم فنی راهساز ماشین،عیوب ناشی از عدم انجام سرویسهای دوره ای و
            استهلاک قطعات مصرفی خارج از پوشش گارانتی میباشد.
          </li>
          <li>
            آسیب هایی که در اثر بی توجهی راننده بوجود آیند (روشن شدن چراغ های
            هشدار، داغ کردن موتور،دیفرانسیل،خروج دود غیرعادی،صدای غیر عادی،درجه
            حرارت بالاتر از حد نرمال،فشار نامناسب روغن…) و راننده بدون توجه به
            آن به ادامه مسیر بپردازد.
          </li>
          <li>
            چنانچه قطعات غیراصلی و غیراستاندارد بر روی ماشین آلات نصب شود، در
            صورت بروز ایراد نه تنها آن قطعه گارانتی نمیشود، بلکه اگر موجب آسیب
            رساندن به سایر قطعات شود،هزینه رفع ایراد مشمول گارانتی نخواهد بود
          </li>
          <li>آسیب های به وجود آمده بر اثر سانحه تصادف یا ضربه خارجی</li>
          <li>
            آسیب هایی که به تشخیص شرکت در اثر بی توجهی مالک به موارد نگهداری و
            سرویس های دوره ای ذکر شده در دفترچه راهنما (کاربری) کمپانی سازنده
            ایجاد شده باشد.
          </li>
          <li>
            تذکر: در صورت عدم انجام سرویس اولیه و سرویس های دوره ای در زمان و
            ساعت کار توصیه شده، گارانتی قطعات یدکی ابطال خواهد شد.
          </li>
          <li>
            صدمات ناشی از هر نوع حمل و نقل ماشین آلات توسط کامیون ها و سایر
            ماشین آلات
          </li>
          <li>
            شکستن پلمپ و یا هرگونه دستکاری و تغییرات در ساعت کار ماشین آلات باعث
            ابطال گارانتی میشود.
          </li>
          <li>
            تغییر کاربری ماشین الات و یا مجموعه های وابسته به آن به غیر از شرایط
            استاندارد تحویلی.
          </li>
          <li>
            اعمال فشار بیش از حد به هر یک از قطعات (شامل تحمیل دور بالا به موتور
            به مدت طولانی،استارت زدن بیش از حد و…)
          </li>
          <li>
            تعمیرات و یا سرویس انجام شده توسط فرد یا افرادی که خارج از تیم فنی
            خدمات پس از فروش شرکت راهساز ماشین باعث ابطال گارانتی میشود.
          </li>
          <li>
            در صورت نصب وسایل اضافی وغیراستاندارد توسط عوامل متفرقه و یا موسسات
            خدماتی غیر از مجموعه شرکت راهساز ماشین که منجر به بروز عیب در سیستم
            های الکتریکی و الکترونیکی و یا به واسطه آن در سایر قطعات ماشین آلات
            شود، تحت پوشش گارانتی نخواهد بود.
          </li>
          <li>
            آسیب های وارده به گیربکس و توربین در اثر نصب PTO و فشار بیش از حد در
            ماشین آلات.
          </li>
        </ul>
        <h4>ب) قطعات مصرفی و مستهلک شونده:</h4>
        <p>
          به قطعاتی اطلاق میشود که معمولا سرعت استهلاک آنها نسبت به سایر قطعات
          بیشتر بوده و نحوه استفاده مشتری از ماشین آلات و شرایطی که ماشین آلات
          در آن مورد بهره برداری قرار میگیرد، در طول عمر این قطعات تاثیر زیادی
          داشته و در اغلب اوقات قبل از اتمام دوره گارانتی نیاز به تعویض آنها
          میباشد.
        </p>
        <h4>ج) لوازم جانبی:</h4>
        <p>
          هیچگونه گارانتی نسبت به قطعات و مجموعه های آسیب دیده که توسط این شرکت
          تامین نگردیده و یا مورد تایید این شرکت نباشد،ارائه نخواهد شد. ضمنا
          آسیب های وارده توسط قطعات و مجموعه های تامین یا تایید نشده از سوی این
          شرکت به قطعات و مجموعه های مشمول گارانتی، گارانتی آنان را نیز باطل
          خواهد کرد و این شرکت هیچ مسئولیتی در قبال آن موارد نخواهد داشت
        </p>
        <h4>د) تغییرات</h4>
        <p>
          چنانچه ماشین آلات خریداری شده توسط مالک یا اشخاص ثالثی تغییر داده شود
          و تغییرات بر اثر نصب قطعات و مجموعه های تهیه شده توسط او باعث آسیب به
          ماشین آلات گردد، مزایای گارانتی شامل ماشین آلات مربوطه نخواهد شد. آسیب
          های وارده به ماشین آلات در اثر جا به جایی در هر یک از اجزا که مورد
          تایید کارخانه سازنده نباشد مانند: تغییر مکان باک اصلی گازوییل، افزودن
          باک یا افزایش حجم باک گازوییل، جا به جایی تانک باد، افزایش یا کاهش طول
          شاسی و … منجر به ابطال گارانتی خواهد شد. هر گونه دستکاری در شماره شاسی
          حک شده بر روی شاسی،پلاک بدنه ماشین آلات و شماره موتور منجر به ابطال
          گارانتی ماشین آلات خواهد شد.
        </p>
        <h4>ه) عدم اطلاع رسانی به موقع</h4>
        <p>
          ادعایی از سوی مالک ماشین آلات مورد توجه خواهد بود، که به صورت کتبی پس
          از ایراد، تسلیم واحد فروش و خدمات پس از فروش گردد.
        </p>
        <h4>و) عملیات سرویس نگهداری</h4>
        <p>
          چک کردن،سفت کردن،هرگونه تنظیم موتور،سیستم سوخت رسانی،تمیزکاری،روغن
          کاری،تعویض روغن،تجدید سوخت گیری، سیال الکترولیت باتری،سیال خنک کننده
          (شامل ضدیخ و ضد خوردگی) شامل گارانتی نمی باشد.
        </p>
        <h4>ز)سایر موارد</h4>
        <ul>
          <li>
            آسیب های ناشی از حوادث طبیعی نظیر سیل،تگرگ،باران
            اسیدی،طوفان،زلزله،تغییرات شدید آب و هوایی و محیطی،رعد وبرق و سایر
            بلایای طبیعی و سقوط اجسام
          </li>
          <li>زنگ زدگی و خوردگی قطعات</li>
          <li>
            صدا یا ارتعاش خیلی کوچک که تاثیری در کیفیت یا عملکرد ماشین آلات
            ندارد
          </li>
          <li>
            نشتی های خیلی کوچک روغن یا چیزهای شبیه آن که باعث کاهش چشمگیر در سطح
            روغن یا نظایر آن نشود.
          </li>
          <li>
            خوردگی یا صدمات خارجی ناشی از پرتو اتمی، برخورد سنگ یا سایر چیزها
          </li>
          <li>صدمات ناشی از اجسام جاده (خار و خاشاک،شن و ماسه،گرد و خاک).</li>
        </ul>
        <h3>سرویس اولیه:</h3>
        <p>
          قطعات خریداری شده میبایست مطابق استاندارد شرکت، در تعمیرگاه های مجاز
          معرفی شده طبق لیست سرویس های اولیه،مورد بازدید اولیه و کنترل کارشناس
          مربوطه قرار گیرد. در این سرویس در صورتی که قطعات تعویضی شامل گارانتی
          گردند، صرفا هزینه فیلترها، مواد و سیالات مصرفی بر عهده خریدار میباشد
        </p>
        <p>
          تبصره: در صورتیکه مالک ماشین آلات در مهلت مقرر جهت انجام سرویس اولیه
          اقدام ننماید گارانتی قطعات باطل خواهد شد.
        </p>
        <h3>سرویس های دوره ای(اجباری):</h3>
        <p>
          . سرویس های اجباری به سرویس هایی اطلاق میگردد که توسط سازنده ماشین
          آلات تعیین میگردد و محدوده انجام آن، شرح بازدیدها، تعویض قطعات مصرفی و
          روانکارهای مورد تایید و نوع قطعاتی که باید مورد بررسی قرار گیرد، در
          انتهای کتابچه کاربری ماشین آلات ارائه شده است
        </p>
        <h3>هزینه سرویس های دوره ای به عهده مالک میباشد:</h3>
        <p>
          انجام سرویس های دوره ای در زمان و ساعت کارکردهای توصیه شده در کتابچه
          ماشین آلات، ضمن تضمین سلامت ماشین آلات،باعث کارکرد بهتر و طول عمر مفید
          بیشتر ماشین آلات خواهد شد
        </p>
        <h3>شرایط گارانتی قطعات اصلی:</h3>
        <p>
          در صورتی که قطعه ای در هر تعمیرگاهی،به غیر از تیم فنی شرکت راهساز
          ماشین تعویض و یا تعمیر شده باشد، فاقد گارانتی بوده و گارانتی لیکن هر
          گونه آسیب احتمالی به سایر قطعات یا مجموعه های وابسته به این قطعه را
          نیز شامل نمیشود
        </p>
      </div>
    </ModalWrapperCustom>
  );
};

export default ModalRules;
